/*************************************************
FileName:     debug_config.h
Copyright (C), 2010-2015, SUNGROW POWER SUPPLY CO., LTD.
Link:         debug_config.c
History:
**************************************************/
#ifndef DEBUG_CONFIG_H
#define DEBUG_CONFIG_H

/************************************************************************
*                  头文件
*************************************************************************/


/************************************************************************
*                  宏定义
*************************************************************************/

#define   DEBUG_PRINT_PATH        (char *)"./Debug.xml"



/************************************************************************
*                  全局函数声明
*************************************************************************/
int32_t xml_debug_config_read ( char* configfilePATH );
/************************************************************************
*                结构体声明
*************************************************************************/

/************************************************************************
*                  全局变量外部引用
*************************************************************************/


//调试信息打印标签
typedef struct 
{

 int32_t debug_fifo_config_print ;
 int32_t  debug_fifo_data_name   ;
 int32_t  debug_fifo_dev_index     ;
 int32_t  debug_set    ;

 int32_t debug_pc_rev_config_print ;

 int32_t  debug_modbus_id   ;
 int32_t  debug_cmd    ;
 
  int32_t  data_filtration    ;  //数据过滤
}debug_module_slave;

extern debug_module_slave debug_module;




#endif
